[
  {
    "image": "https://i.ibb.co.com/bq1gBQw/img13.jpg",
    "title": "Music Player",
    "companyName": "Gan Bangla",
    "id": 1,
    "description":"The Music Player is a landmark in technological evolution, transforming how we experience sound. From the phonograph and gramophone to the Walkman, CD, and iPod, it has continuously adapted to new formats and lifestyles. Today’s digital players — often built into smartphones — combine advanced decoding, amplification, and AI-powered streaming to deliver high-quality, personalized listening. Beyond playback, they shape culture by turning music into a personal soundtrack, popularizing playlists, and driving innovations like Spatial Audio and Hi-Res sound, keeping the music player central to our emotional connection with sound.",
    "size": 42,
    "reviews": 1445,
    "ratingAvg": 2.5,
    "downloads": 52200,
    "ratings": [
      { "name": "1 star", "count": 45 },
      { "name": "2 star", "count": 90 },
      { "name": "3 star", "count": 210 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 600 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/j9FvRCTL/img14.jpg",
    "title": "ChatGPT",
    "companyName": "Pixel Dynamics",
    "id": 2,
    "description": "TaskFlow is a smart task management app that combines AI-driven insights with an intuitive kanban interface to boost productivity. It enables seamless collaboration, smart reminders, and easy automation, while integrating with tools like Google Calendar and Slack. With powerful analytics, strong security, and offline access, TaskFlow helps individuals and teams stay organized, efficient, and focused anywhere.",
    "size": 80,
    "reviews": 5300,
    "ratingAvg": 5.0,
    "downloads": 1100000,
    "ratings": [
      { "name": "1 star", "count": 100 },
      { "name": "2 star", "count": 200 },
      { "name": "3 star", "count": 400 },
      { "name": "4 star", "count": 1200 },
      { "name": "5 star", "count": 3500 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/BH8x2K3X/img15.jpg",
    "title": "Spotify",
    "companyName": "Skyline Labs",
    "id": 3,
    "description": "Spotify is a next-generation music management platform designed to enhance productivity for individuals and teams. Going beyond simple to-do lists, it combines an intuitive kanban interface with AI-powered reminders that optimize your schedule and help prevent burnout. Users can collaborate in real time, organize tasks with advanced filters and tags, and gain actionable insights through a comprehensive analytics dashboard.",
    "size": 125,
    "reviews": 2100,
    "ratingAvg": 3.5,
    "downloads": 300000,
    "ratings": [
      { "name": "1 star", "count": 60 },
      { "name": "2 star", "count": 100 },
      { "name": "3 star", "count": 250 },
      { "name": "4 star", "count": 700 },
      { "name": "5 star", "count": 990 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/yFjCGF6k/img16.jpg",
    "title": "Visual Studio Code (VS Code)",
    "companyName": "ActiveCore",
    "id": 4,
    "description":"Visual Studio is a comprehensive integrated development environment (IDE) from Microsoft, designed to streamline the process of building applications across multiple platforms, including desktop, web, mobile, and cloud. It offers advanced code editing, debugging, and testing tools, along with seamless integration with version control systems like Git. With features like IntelliSense, refactoring, extensions, and collaboration tools, Visual Studio empowers developers to write, manage, and deploy high-quality software efficiently, making it a cornerstone for modern software development.",
    "size": 265,
    "reviews": 8700,
    "ratingAvg": 3.9,
    "downloads": 2300000,
    "ratings": [
      { "name": "1 star", "count": 250 },
      { "name": "2 star", "count": 340 },
      { "name": "3 star", "count": 600 },
      { "name": "4 star", "count": 2200 },
      { "name": "5 star", "count": 5300 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/N65gCvLW/img18.jpg",
    "title": "Google Maps",
    "companyName": "Google",
    "id": 5,
    "description":  "Google Maps is a powerful web and mobile mapping service that provides detailed geographic information, including maps, satellite imagery, street views, and real-time traffic data. It helps users navigate from one location to another, discover businesses, restaurants, and points of interest, and plan routes for driving, walking, biking, or public transportation. With features like live traffic updates, location sharing, offline maps, and personalized recommendations, Google Maps has become an essential tool for travel, navigation, and local exploration worldwide.",
    "size": 55,
    "reviews": 3100,
    "ratingAvg": 4.3,
    "downloads": 780000,
    "ratings": [
      { "name": "1 star", "count": 180 },
      { "name": "2 star", "count": 250 },
      { "name": "3 star", "count": 600 },
      { "name": "4 star", "count": 1000 },
      { "name": "5 star", "count": 1070 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/dwcPJmgn/img19.jpg",
    "title": "Figma",
    "companyName": "BrightVault",
    "id": 6,
    "description":  "Figma is a cloud-based design and prototyping tool that enables teams to create, collaborate, and iterate on user interfaces and experiences in real time. It combines vector graphics editing, interactive prototyping, and collaborative feedback in a single platform, allowing designers, developers, and stakeholders to work seamlessly together. With features like component libraries, version control, plugins, and cross-platform access, Figma has become a leading solution for UI/UX design and product development.",
    "size": 80,
    "reviews": 49000,
    "ratingAvg": 4.6,
    "downloads": 1250000,
    "ratings": [
      { "name": "1 star", "count": 140 },
      { "name": "2 star", "count": 230 },
      { "name": "3 star", "count": 500 },
      { "name": "4 star", "count": 1200 },
      { "name": "5 star", "count": 2830 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Jw5bDJ7c/img20.jpg",
    "title": "Discord",
    "companyName": "EduVerse",
    "id": 7,
    "description":  "Discord is a communication platform designed for creating communities, enabling users to connect via voice, video, and text chat. Originally popular among gamers, it now serves a wide range of communities, providing servers, channels, and roles to organize conversations efficiently. With features like screen sharing, integrations with apps, bots, and moderation tools, Discord makes collaboration, social interaction, and community building seamless across desktop and mobile devices.",
    "size": 255,
    "reviews": 88000,
    "ratingAvg": 4.1,
    "downloads": 2600000,
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 700 },
      { "name": "4 star", "count": 1600 },
      { "name": "5 star", "count": 5900 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/KxdPLVP8/img21.jpg",
    "title": "Adobe Lightroom",
    "companyName": "MelodySoft",
    "id": 8,
    "description":  "Adobe is a global software company renowned for its creative and multimedia solutions, offering powerful tools for graphic design, video editing, web development, photography, and digital marketing. Its flagship products, including Photoshop, Illustrator, Premiere Pro, and Acrobat, enable professionals and creatives to produce high-quality content across multiple platforms. With cloud-based services like Adobe Creative Cloud, users can collaborate, store, and access their work seamlessly, making Adobe a cornerstone of modern creative workflows.",
    "size": 220,
    "reviews": 12000,
    "ratingAvg": 3.7,
    "downloads": 5000000,
    "ratings": [
      { "name": "1 star", "count": 450 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 2500 },
      { "name": "5 star", "count": 7450 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/9m6C9c9q/img24.jpg",
    "title": "GitHub",
    "companyName": "GitHub",
    "id": 9,
    "description": "GitHub is a web-based platform for version control and collaborative software development, built around Git. It allows developers to host, review, and manage code, track changes, and work together on projects through repositories, pull requests, and issues. With features like GitHub Actions, project boards, and integration with other tools, it has become the leading hub for developers to collaborate, share open-source projects, and streamline software development workflows.",
    "size": 68,
    "reviews": 4600,
    "ratingAvg": 5.0,
    "downloads": 980000,
    "ratings": [
      { "name": "1 star", "count": 210 },
      { "name": "2 star", "count": 280 },
      { "name": "3 star", "count": 500 },
      { "name": "4 star", "count": 1200 },
      { "name": "5 star", "count": 2410 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/KctJs45j/app1.jpg",
    "title": "WeChat",
    "companyName": "ReadZone",
    "id": 10,
    "description": "WeChat is a multifunctional messaging and social media app developed by Tencent, combining text and voice messaging, video calls, and group chats with a rich ecosystem of services. Beyond communication, it offers mobile payments, mini-programs, news, and social networking features, making it a comprehensive platform for daily life and business. Widely used worldwide, WeChat integrates messaging, social media, and digital services into a single, seamless experience.",
    "size": 48,
    "reviews": 35000,
    "ratingAvg": 2.5,
    "downloads": 720000,
    "ratings": [
      { "name": "1 star", "count": 100 },
      { "name": "2 star", "count": 200 },
      { "name": "3 star", "count": 500 },
      { "name": "4 star", "count": 1000 },
      { "name": "5 star", "count": 1700 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/ZRm5pcvq/img23.jpg",
    "title": "Steam",
    "companyName": "Steam",
    "id": 11,
    "description":  "Steam is a digital distribution platform developed by Valve, primarily for video games and software. It allows users to purchase, download, and manage games, as well as connect with friends through community features, multiplayer gaming, and social hubs. With features like cloud saves, automatic updates, workshops for user-generated content, and extensive sales, Steam has become one of the most popular platforms for gamers worldwide.",
    "size": 38,
    "reviews": 82000,
    "ratingAvg": 5.0,
    "downloads": 2000000,
    "ratings": [
      { "name": "1 star", "count": 80 },
      { "name": "2 star", "count": 130 },
      { "name": "3 star", "count": 400 },
      { "name": "4 star", "count": 1200 },
      { "name": "5 star", "count": 6390 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/RTb8bFPM/img1.jpg",
    "title": "Slack",
    "companyName": "ClimateIQ",
    "id": 12,
    "description":  "Slack is a collaboration and messaging platform designed for teams to communicate efficiently in real time. It offers channels, direct messaging, file sharing, and integrations with hundreds of apps to streamline workflows and centralize communication. With features like searchable message history, notifications, and collaboration tools, Slack helps teams stay organized, connected, and productive across projects and locations.",
    "size": 40,
    "reviews": 2500,
    "ratingAvg": 4.2,
    "downloads": 510000,
    "ratings": [
      { "name": "1 star", "count": 180 },
      { "name": "2 star", "count": 250 },
      { "name": "3 star", "count": 480 },
      { "name": "4 star", "count": 900 },
      { "name": "5 star", "count": 670 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/YBt0d6xj/img2.jpg",
    "title": "ChatWave",
    "companyName": "ComNet",
    "id": 13,
    "description":  "ChatWave is a customer engagement platform that integrates with WhatsApp, allowing businesses to automate interactions, manage campaigns, and provide real-time support. It features AI chatbots, campaign management, template handling, analytics, and API integrations, enabling seamless communication and enhanced customer experience.",
    "size": 58,
    "reviews": 15000,
    "ratingAvg": 4.7,
    "downloads": 6800000,
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 700 },
      { "name": "3 star", "count": 1200 },
      { "name": "4 star", "count": 3100 },
      { "name": "5 star", "count": 9500 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/5WFgpjwW/img3.jpg",
    "title": "WhatsApp",
    "companyName": "eComify",
    "id": 14,
    "description": "WhatsApp is a globally popular messaging and communication app that allows users to send texts, voice messages, images, videos, and documents, as well as make voice and video calls. It supports group chats and offers cross-platform functionality, enabling seamless communication across smartphones, tablets, and desktops. With end-to-end encryption, WhatsApp ensures that all conversations remain private and secure. Additional features like status updates, location sharing, and WhatsApp Web make it a versatile tool for both personal and professional communication. Its simplicity, reliability, and global reach have made it one of the most widely used messaging platforms in the world.",
    "size": 60,
    "reviews": 9400,
    "ratingAvg": 4.6,
    "downloads": 3500000,
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 900 },
      { "name": "4 star", "count": 2400 },
      { "name": "5 star", "count": 5100 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/nNncf6Xt/img7.png",
    "title": "Telegram",
    "companyName": "Telegram",
    "id": 15,
    "description":  "Telegram is a cloud-based messaging app that allows users to send texts, voice messages, photos, videos, and files of any type, as well as make voice and video calls. It supports group chats, channels, and bots, making it ideal for both personal and large-scale community communication. With end-to-end encryption for secret chats and robust privacy settings, Telegram ensures secure and private messaging. Additional features like cloud storage, multi-device access, and customizable themes enhance the user experience. Known for its speed, security, and versatility, Telegram has become a popular choice worldwide for messaging and content sharing.",
    "size": 95,
    "reviews": 20000,
    "ratingAvg": 4.9,
    "downloads": 7800000,
    "ratings": [
      { "name": "1 star", "count": 700 },
      { "name": "2 star", "count": 1000 },
      { "name": "3 star", "count": 1400 },
      { "name": "4 star", "count": 3000 },
      { "name": "5 star", "count": 14900 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/n84QyxKf/img8.jpg",
    "title": "Twitter",
    "companyName": "X",
    "id": 16,
    "description":  "Twitter is a social media platform that allows users to share short messages called tweets, as well as photos, videos, and links. It enables real-time communication, trending news, and discussions across global communities. Users can follow accounts, like, retweet, and reply to engage with content, making it highly interactive. With features like threads, hashtags, and lists, Twitter helps organize conversations and discover topics of interest. Known for its speed and immediacy, Twitter is widely used for news, social networking, and public discourse worldwide.",
    "size": 70,
    "reviews": 2300,
    "ratingAvg": 4.4,
    "downloads": 410000,
    "ratings": [
      { "name": "1 star", "count": 120 },
      { "name": "2 star", "count": 190 },
      { "name": "3 star", "count": 300 },
      { "name": "4 star", "count": 800 },
      { "name": "5 star", "count": 890 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/TD6Z2VXb/img9.jpg",
    "title": "WhatsApp",
    "companyName": "ChainLinkers",
    "id": 17,
    "description":  "WhatsApp is a globally popular messaging and communication app that allows users to send texts, voice messages, images, videos, and documents, as well as make voice and video calls. It supports group chats and offers cross-platform functionality, enabling seamless communication across smartphones, tablets, and desktops. With end-to-end encryption, WhatsApp ensures that all conversations remain private and secure. Additional features like status updates, location sharing, and WhatsApp Web make it a versatile tool for both personal and professional communication. Its simplicity, reliability, and global reach have made it one of the most widely used messaging platforms in the world.",
    "size": 64,
    "reviews": 7800,
    "ratingAvg": 4.6,
    "downloads": 2700000,
    "ratings": [
      { "name": "1 star", "count": 240 },
      { "name": "2 star", "count": 380 },
      { "name": "3 star", "count": 700 },
      { "name": "4 star", "count": 1900 },
      { "name": "5 star", "count": 4580 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/LdgVvR4t/img11.jpg",
    "title": "Skype",
    "companyName": "Microsoft",
    "id": 18,
    "description":  "Skype is a communication platform that allows users to make voice and video calls, send instant messages, and share files across devices. It supports group calls and conferences, making it ideal for both personal and professional use. With features like screen sharing, call recording, and integration with Microsoft 365, Skype enhances collaboration and remote communication. It is available on desktop, mobile, and web, providing flexibility and convenience. Known for its reliability and ease of use, Skype remains a popular tool for connecting people globally.",
    "size": 33,
    "reviews": 4200,
    "ratingAvg": 4.5,
    "downloads": 1300000,
    "ratings": [
      { "name": "1 star", "count": 180 },
      { "name": "2 star", "count": 240 },
      { "name": "3 star", "count": 550 },
      { "name": "4 star", "count": 1000 },
      { "name": "5 star", "count": 2230 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/5x9DbQWy/img10.jpg",
    "title": "instagram",
    "companyName": "Meta",
    "id": 19,
    "description":  "Instagram is a social media platform that allows users to share photos, videos, and stories with their followers. It supports Reels, IGTV, and direct messaging, enabling both creative expression and private communication. With features like filters, hashtags, and explore pages, Instagram helps users discover content and connect with communities worldwide. It is widely used for personal sharing, influencer marketing, and brand promotion, making it a versatile tool for social networking and visual storytelling.",
    "size": 47,
    "reviews": 3500,
    "ratingAvg": 4.3,
    "downloads": 640000,
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 260 },
      { "name": "3 star", "count": 450 },
      { "name": "4 star", "count": 1000 },
      { "name": "5 star", "count": 1590 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/LdgVvR4t/img11.jpg",
    "title": "Skype",
    "companyName": "Sync",
    "id": 20,
    "description":  "Skype is a communication platform that allows users to make voice and video calls, send instant messages, and share files across devices. It supports group calls and conferences, making it ideal for both personal and professional use. With features like screen sharing, call recording, and integration with Microsoft 365, Skype enhances collaboration and remote communication. It is available on desktop, mobile, and web, providing flexibility and convenience. Known for its reliability and ease of use, Skype remains a popular tool for connecting people globally.",
    "size": 50,
    "reviews": 6100,
    "ratingAvg": 4.7,
    "downloads": 1900000,
    "ratings": [
      { "name": "1 star", "count": 220 },
      { "name": "2 star", "count": 340 },
      { "name": "3 star", "count": 600 },
      { "name": "4 star", "count": 1400 },
      { "name": "5 star", "count": 3540 }
    ]
  }
]